#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azuread_service_principal.spn: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # azurerm_data_factory.data_factory will be created
  + resource "azurerm_data_factory" "data_factory" {
      + id                     = (known after apply)
      + location               = "francecentral"
      + name                   = "data-factory-esg-einstein-dev"
      + public_network_enabled = true
      + resource_group_name    = "rg-esg-einstein-dev"
    }

  # azurerm_logic_app_standard.logic_app will be created
  + resource "azurerm_logic_app_standard" "logic_app" {
      + app_service_plan_id            = (known after apply)
      + app_settings                   = (known after apply)
      + bundle_version                 = "[1.*, 2.0.0)"
      + client_affinity_enabled        = (known after apply)
      + custom_domain_verification_id  = (known after apply)
      + default_hostname               = (known after apply)
      + enabled                        = true
      + https_only                     = false
      + id                             = (known after apply)
      + kind                           = (known after apply)
      + location                       = "francecentral"
      + name                           = "logic-app-esg-einstein-dev"
      + outbound_ip_addresses          = (known after apply)
      + possible_outbound_ip_addresses = (known after apply)
      + resource_group_name            = "rg-esg-einstein-dev"
      + site_credential                = (known after apply)
      + storage_account_access_key     = (sensitive value)
      + storage_account_name           = "esgeinsteindev"
      + storage_account_share_name     = (known after apply)
      + use_extension_bundle           = true
      + version                        = "~3"
    }

  # azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "francecentral"
      + name     = "rg-esg-einstein-dev"
    }

  # azurerm_service_plan.app_service_plan will be created
  + resource "azurerm_service_plan" "app_service_plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "francecentral"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "service-plan-esg-einstein-dev"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rg-esg-einstein-dev"
      + sku_name                     = "WS1"
      + worker_count                 = (known after apply)
    }

  # azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "francecentral"
      + min_tls_version                   = "TLS1_2"
      + name                              = "esgeinsteindev"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rg-esg-einstein-dev"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "environment" = "dev"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @vmisson, Action: `pull_request`*